In this case, I didn't use these labels so I decided to destroy all labels and recreate them.
 

```console
  # github_issue_label.year_month_definition_labels[3] will be destroyed
  # (because resource does not use count)
  - resource "github_issue_label" "year_month_definition_labels" {
      - color       = "9ac244" -> null
      - etag        = "W/\"cdf93ad1effc985443f730049ce29b994655f980b2dde79e3ff8ab6d5b3beb6d\"" -> null
      - id          = "github-config:2023/04" -> null
      - name        = "2023/04" -> null
      - repository  = "github-config" -> null
      - url         = "https://api.github.com/repos/go-zen-chu/github-config/labels/2023/04" -> null
        # (1 unchanged attribute hidden)
    }


...

  # github_issue_label.year_month_definition_labels["github-config-2023/01"] will be created
  + resource "github_issue_label" "year_month_definition_labels" {
      + color      = "c7402c"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "2023/01"
      + repository = "github-config"
      + url        = (known after apply)
    }

  # github_issue_label.year_month_definition_labels["github-config-2023/02"] will be created
  + resource "github_issue_label" "year_month_definition_labels" {
      + color      = "5e7db9"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "2023/02"
      + repository = "github-config"
      + url        = (known after apply)
    }

Plan: 48 to add, 0 to change, 48 to destroy.
```